[
	{
		"title": "Basado en Componentes",
		"imagePath": "images/Methodologies/Traditional/Basado en Componentes.png",
		"content": [
			{
				"type": "ImageConcept",
				"concept": [
					"Es una metodología que incorpora muchas de las características del modelo en espiral y permite establecer un objetivo mínimo alcanzable. Esta se basa en utilizar componentes existentes o creados por el desarrollador, de manera que también es posible modificar los componentes ya existentes y adecuarlos al proyecto en cuestión, para lograr el objetivo que se quiere alcanzar.",
					"A diferencia de la metodología en espiral clásica, esta se diferencia en que considera la anexión de elementos que pueden ser externos, y construir aplicaciones mediante el ensamblado de módulos de software reutilizables, los cuales fueron desarrollados de forma independiente a las aplicaciones en las que serán utilizados."
				]
			},
			{
				"type": "section",
				"header": "¿Porqué se usa?",
				"bodyCopy": "Se usa principalmente por las siguientes características:",
				"content": [
					{
						"type": "list",
						"list": [
							"**Reutilización del software:** lo que nos lleva a alcanzar un mayor nivel de reutilización de software.",
							"**Simplificación de las pruebas:** permite que las pruebas sean ejecutadas probando cada uno de los componentes antes de probar el conjunto completo de componentes ensamblados.",
							"**Simplifica el mantenimiento del sistema:** cuando existe un débil acoplamiento entre componentes, el desabollador es libre de actualizar y/o agregar componentes según sea necesario, sin afectar otras partes del sistema.",
							"**Mayor calidad:** dado que un componente puede ser construido y luego mejorado continuamente por un experto u organización, la calidad de una aplicación basada en componentes mejorará con el paso del tiempo."
						]
					}
				]
			},
			{
				"type": "specialSection",
				"content": [
					"**Servicios Web**, donde se requiere seguir estándares de servicios y están disponibles por invocación remota.",
					"**Aplicaciones Web**, donde se puede seccionar partes del sistema con funcionalidades independientes y/o se conozca de soluciones de software de terceros que fácilmente se puedan integrar y personalizar.",
					"**Colecciones de objetos**, que son desarrollados como un paquete.",
					"**Sistemas de software**, stand-alone, que puedan ser configurados para su uso en un ambiente en particular."
				]
			},
			{
				"type": "references",
				"content": [
					"https://sites.google.com/site/lawebdelsoftware/ingenieria-de-software-1/unidad-vi",
					"https://matriarm.wordpress.com/desarrollo-basado-en-componentes/"
				]
			}
		]
	},
	{
		"title": "Espiral",
		"imagePath": "images/Methodologies/Traditional/Espiral.png",
		"content": [
			{
				"type": "ImageConcept",
				"concept": [
					"Modelo de proceso de software evolutivo donde se pueden utilizar prototipos y unirlos para crecer la complejidad del sistema que se quiere desarrollar.",
					"Proporciona el potencial para el desarrollo rápido de versiones incrementales del software."
				]
			},
			{
				"type": "section",
				"header": "¿De qué se compone?",
				"bodyCopy": "Cada vuelta se divide en 4 sectores:",
				"content": [
					{
						"type": "numberList",
						"list": [
							"**Planificación:** determinación de los objetivos, alternativas y restricciones.",
							"**Análisis de riesgo:** análisis de alternativas e identificación/resolución de riesgos.",
							"**Ingeniería o implementación:** desarrollo del producto hasta \"el siguiente nivel\".",
							"**Evaluación:** valoración por parte del cliente de los resultados obtenidos."
						]
					}
				]
			},
			{
				"type": "specialSection",
				"content": [
					"El proyecto es grande.",
					"Se quiere que las liberaciones de software sean frecuentes.",
					"Aplica la creación de un prototipo.",
					"Es primordial un control de riesgos y costos.",
					"En proyectos catalogados de riesgo medio-alto y alto.",
					"Los requisitos son poco claros y complejos.",
					"Hay un alto grado de cambios y estos pueden aparecer en cualquier momento.",
					"El compromiso de proyecto a largo plazo está comprometido, bien sea por razones económicas u otras."
				]
			},
			{
				"type": "references",
				"content": [
					"Fuente: Desconocido. (septiembre 2013). ¿Qué es una metodología de desarrollo de Software?. [Online]. Disponible en: https://www.4rsoluciones.com/blog/una-metodologia-desarrollo-software/"
				]
			}
		]
	}
]
